#' abc for R
#'
#' @param a quadratic coefficient
#' @param b linear coefficient
#' @param c constant
#' @return root
#' @export
abc <- function(a){
  cat(" 1) Описательная статистика
        E(X)
        F - столбец данных
       19. xср	СРЗНАЧ(F:F)
       20. s	СТАНДОТКЛОН.В(F:F)
       21. n	СЧЁТ(F:F)
       22. t	СТЬЮДЕНТ.ОБР(1-I23/2;I21-1)
       23. альфа	1-I24
       24. гамма	0,95
       25. дельта	I20*I22/КОРЕНЬ(I21)
       26. границы доверительного интервала	
       27. E(X1)	I19-I25
       28. E(X2)	I19+I25

       Var(X)	
       33. n	СЧЁТ(F:F)
       34. s^2	ДИСП.В(F:F)
       35. xи2 лев	ХИ2.ОБР(I37/2;I33-1)
       36. хи2 прав	ХИ2.ОБР(1-I37/2;I33-1)
       37. альфа	1-I38
       38. гамма	0,95
       39. границы доверительного интервала	
       40. Var(X1)	(I33-1)*I34/I36
       41. Var(X2)	(I33-1)*I34/I35
       42. s(X1)	КОРЕНЬ(I40)
       43. s(X2)	КОРЕНЬ(I41)

      Тест 1
      Н0: r=0	статистически незначим
      H1: rне=0	статистически значим
      PV < 0,005 => Н0 отклоняется коэф коррел статистически значим
      для 3 компаний по столбцу логдоходности
      cor.test(X$V1, Y$V1) 
      cor.test(X$V1, Y$V1)$p.value
      cor.test(X$V1, Y$V1)$p.value<0.005

      Тест 2
      𝐻0:𝐸(𝑋𝑖)=0		альфа=0,05
      𝐻1:𝐸(𝑋𝑖)≠0
      t.test(X$V1, mu=0)  $p.value   	
      t.test(X$V1, mu=0)  $p.value <0.05 
      больше альфа	не отклоняется
      меньше альфа	отклоняется

      Тест 3
      𝐻0:𝐸(𝑋𝑖)=𝐸(𝑋𝑗)		
      𝐻1:𝐸(𝑋𝑖)≠𝐸(𝑋𝑗)		
      альфа=0,05
      t.test(X$V1, Y$V1)$p.value 		
      t.test(X$V1, Y$V1)$p.value <0.05 		

      Тест 4
      Н0: Var(X)=Var(Y)	
      H1: Var(X)не=Var(Y)	
      альфа=0,05	
      var.test(X$V1, Y$V1)$p.value 		
      var.test(X$V1, Y$V1)$p.value <0.05 		

      Тест 5
      lillie.test(X$V1) 		
      lillie.test(X$V1)$p.value 		
      lillie.test(X$V1)$p.value < 0.001 		

    #gde ' tam dve '
    # source('Ci.R')      # Подключаем файл Ci.R данной командой 
      #-------------------------------------------------------------------------------------
      # Доверительные интервалы
      # ciE(Rez,0.95)       # Вычисляет доверительный интервал для E по выборке Rez
      # ciD(Rez,0.95)       # Вычисляет доверительный интервал для D по выборке Rez
      
      ciE <- function(X, Gamma) {
        n <- length(X)
        ciE <- mean(X, na.rm = TRUE)-sd(X, na.rm = TRUE)/sqrt(n)*qt((1+c(Gamma,0,-Gamma))/2,n-1)
        Interval <- cbind(E.Left = ciE[1],E.Right = ciE[3])
        Res <- list(Eo = ciE[2], Interval = Interval)
        return(Res)
      }
      #--------------------------
      # Доверительный интервал для генеральной дисперсии (или для истинной дисперсии) по выборке
      ciD <- function(X, Gamma) {
        n <- length(X)
        ciD <- sd(X, na.rm = TRUE)^2*(n-1)/qchisq((1+c(Gamma,0,-Gamma))/2,n-1)
        Interval <- cbind(D.Left = ciD[1], D.Right = ciD[3])
        Res <- list(Do = var(X), Interval = Interval)
        return(Res)
      }
      #-----------------------------------------------------------------------------------------
      # Доверительный интервал для генеральной доли (или для истинной вероятности) по выборке
      ciP <- function(k,n,N,Gamma) {
        if (N == Inf) {ciP <- k/n-sqrt(k/n*(1-k/n)/n)*qnorm((1+c(Gamma,0,-Gamma))/2)} 
        else  {ciP <- k/n-sqrt(k/n*(1-k/n)/n)*sqrt(1-n/N)*qnorm((1+c(Gamma,0,-Gamma))/2)}
        Interval <- cbind(P.Left = max(0,ciP[1]), P.Right = min(1,ciP[3]))
        Res <- list(Po = ciP[2], Interval = Interval)
        return(Res)
      }
      ciP(10,21,Inf,0.95)  # Для повторной выборки
      ciP(10,21,100,0.95)  # Для бесповторной выборки с указанием объема генеральной совокупности
      #-------------------------------------------------------------------------------------
      # Непрерывная с.в. X с произвольно заданной функцией плотности f(x) на [a, b], включая b = inf.
      # ВАЖНО! Необходимая Функция плотности f <- function(x) {x*exp(-x)} должна быть объявлена заранее
      
      # is.fun(f, a = 0, b = Inf)        # Проверяет нормировку функции плотности f 
      # rfun(n = 300, f, a = 0, b = 4)   # Наблюдения n раз случайной величины X ~ f(x), локализованной на [a, b]
      # pfun(q = 2, f, a = 0, b = 3)     # Вероятность P[X ≤ q] для X ~ f(x), локализованной на [a, b]
      # dfun(x = 3, f, a = -5, b = Inf)  # Плотность f(x) для X ~ f(x), локализованной на [a, b]
      # qfun(p = 0.5, f, a = 4, b = 100) # Квантиль уровня p для X ~ f(x), локализованной на [a, b]
      
      #--------------------------
      # Проверяет условие нормировки функции плотности вероятности f на области локализации [a, b] 
      
      is.fun <- function(f, a, b) {
        if (abs(integrate(f,a,b)$value - 1) > 10^(-8)) {return(paste(integrate(f,a,b)$value,' Opps...! f is not density!'))}
        else { return('OK!')}
      }
      
      #--------------------------
      # Разыгрывает n раз случайную величину X c плотностью вероятности f, локализованную на [a, b]
      # P.S. Параметр step - шаг по x при вычислении интегрального уравнения, по умолчанию 0.01
      
      rfun <- function(n, f, a, b, step = 0.01) {
        X <- rep(a, n) # Назначаем X в начале каждого i-го опыта из n самому левому значению: a
        Y <- runif(n)    # n раз генерируем равномерную с.в. Y на (0,1)
        for (i in 1:n) {
          I <- 0
          while(I < Y[i]) { # Этот цикл решает интегральное уравнение для генерации X по Y
            X[i] <- X[i] + step
            I <- integrate(f, a, X[i])$value
          }
          X[i] <- X[i] - step
        }
        return(X)
      }
      
      #--------------------------
      # Вычисляет вероятность P(X ≤ q) для X ~ f(x), локализованной на [a, b].
      
      pfun <- function(q, f, a, b) {
        if (q < a) {return(0)} else 
          if (q > b) {return(1)} else {
            P <- sapply(q, function(q) {integrate(f, a, q)$value})
            return(P) 
          }
      }
      
      #--------------------------
      # Вычисляет значение плотности вероятности f в точке x для X ~ f(x), локализованной на [a, b] .
      
      dfun <- function(x, f, a, b) {
        return(f(x)) 
      }  
      
      #--------------------------
      # Вычисляет квантиль уровня p для X ~ f(x), локализованной на [a, b] .
      # P.S. Параметр step - шаг по x при вычислении интегрального уравнения, по умолчанию 0.001
      
      qfun <- function(p, f, a, b, step = 0.01) {
        q <- a
        I <- 0
        while(I < p) { # Этот цикл решает интегральное уравнение
          q <- q + step
          I <- integrate(f, a, q)$value
        }
        return(q - step) 
      }
      #---------Проверка равенства долей--------------------
      EqP <- function(k1, k2, n1, n2) {
        p1 <- k1/n1; p2 <- k2/n2; p <- (k1+k2)/(n1+n2)
        Z <- (p1-p2-0.5/(n1+n2))/(p*(1-p)*(1/n1+1/n2))^0.5
        #  by(X, Y, mean)
        Res <- paste('Pvalue = ', round(2*(1-pnorm(abs(Z))), 5))
        return(Res)
      })
  }
  library(psych)
  library(e1071)
  data <- c(1.46, -0.62, -0.21, -0.71, 0.11, -0.24, 0.37, 0.44, -0.64, -0.77, -0.06, 0.03, 0.25, 0.44, -1.07, 0.49, 0.4, -0.44, 0.02, 0.31, 0.67, 1.22, -1.12, 1.56, 0.9, -0.8, 0.04, 0.92, -0.47, -0.54, -1.68, 0.3, 0.94, 0.9, -0.24, -1.02, 1.22, -0.31, 1.14, -0.9, -0.21, 0.98, -1.07, 0.12, -2.18, -0.63, -0.66, 0.05, 0.34, 0.03, -0.1, 0.15, -0.34, -1.36, 0.31, 0.99, -0.65, -0.52, -0.12, -0.44, 0.21, 0.33, 0.78, -0.55, -1.04, -1.02, -2.29, 0.14, -0.84, 1.65, 1.82, 0.16, 1.27, 1.42, -0.8, -0.31, 0.26, -0.32, -1.2, -1.34, 1.13, -0.66, 1.37, -2.03, -0.22, 1.72, 0.05, -0.01, -0.08, 2.21, 0.52, 1.41, 0.83, -0.76, -0.86, -0.77, -0.14, -1.4, 0.3, -0.81, 0.03, 1.27, -0.25, 0.21, -0.32, -2.11, -0.42, -0.66, -1.17, -0.79, -0.51, -2.18, -0.69, 0.35, -0.74, 0.23, -1.1, 0.09, 0.89, 0.11, 0.06, -0.1, -0.29, 0.75, -0.6, 0.71, 0.91, -1.18, -0.38, -0.49, -0.21, -0.49, 0.67, 0.4, -0.68, -1.57, 2.44, -0.71, 1.11, 0.24, -0.76, -1.09, -0.49, 0.52, 0.94, 0.49, 0.86, -0.09, -0.97, -0.37, 0.6, -2.64, -0.4, -1.42, -0.91, 0.36, -0.48, 0.22, 0.52, 1.46, -0.21, 2.52, 3.06, -1.29, 0.51, -1.31, -1.05, -0.79, 2.3, -2.08, -0.85, -1.4, -0.91, -0.58, -0.27, 0.4, 0.3, 1.22, 0.23, 0.47, 0.75, -0.12, -1.02, -1.52, 0.47, -1.36, 0.12, -0.1, 0.19, -0.23, -0.75, -2.36, -1.2, -2.08, 0.22, 0.33, 0.07, 1.05, 0.61, 0.2, -1.67)
  length(data)
  summary(data)
  describe(data)
  IQR(data) # Межквартильный размах
  quantile(data, probs = 0.38) # Квантиль уровня
  var(data, y = NULL, na.rm = FALSE) #Дисперсия выборки (несмещенная)
  skew(data)#	Асимметричность (несмещенная оценка)
  kurtosi(data)#	Эксцесс (несмещенная оценка)
  psych::describe(data)
  IQR <- IQR(data)
  Q1 <- quantile(data, .25)#	Нижняя граница нормы
  lower_b <- Q1 - 1.5*IQR
  lower_b
  #спросить
  Q3 <- quantile(data, .75)#Верхняя граница нормы
  upper_b <- Q3 + 1.5*IQR
  upper_b
  extra <- data[data<lower_b | data > upper_b]
  extra
  no_outliers <- subset(data, data> (Q1 - 1.5*IQR) & data< (Q3 + 1.5*IQR))
  length(data) - length(no_outliers)
  #1.2
  var(no_outliers, y = NULL, na.rm = FALSE) #Дисперсия выборки (несмещенная)
  # Доверительные интервалы

  ciE <- function(X, Gamma) {
    n <- length(X)
    ciE <- mean(X, na.rm = TRUE)-sd(X, na.rm = TRUE)/sqrt(n)*qt((1+c(Gamma,0,-Gamma))/2,n-1)
    Interval <- cbind(E.Left = ciE[1],E.Right = ciE[3])
    Res <- list(Eo = ciE[2], Interval = Interval)
    return(Res)
  }
  #--------------------------
  # Доверительный интервал для генеральной дисперсии (или для истинной дисперсии) по выборке
  ciD <- function(X, Gamma) {
    n <- length(X)
    ciD <- sd(X, na.rm = TRUE)^2*(n-1)/qchisq((1+c(Gamma,0,-Gamma))/2,n-1)
    Interval <- cbind(D.Left = ciD[1], D.Right = ciD[3])
    Res <- list(Do = var(X), Interval = Interval)
    return(Res)
  }
  ciE(no_outliers,0.96)
  ciD(no_outliers,0.96)
  #Гистограмма интервальных частот
  hist(data) 
  #Диаграмма размаха ('ящик с усами')
  boxplot(data,ylab='data')

  #Часть 2
  library(stringr)
  data_2 <- c(0)
  data_2 = str_replace_all(data_2, '[;]', ',')
  data_2 = str_replace_all(data_2, '[()]', '')
  data_2
  data_2 <- c()
  n <- matrix(data_2, nrow = 2)
  n = t(n)
  dim(n)
  n
  X = n[, 1]
  Y = n[, 2]
  X
  Y
  #1.2
  cor(X, Y)
  mean(X)
  mean(Y)
  var(X, y = NULL, na.rm = FALSE) #Дисперсия (несмещенная)
  var(Y, y = NULL, na.rm = FALSE) #Дисперсия  (несмещенная)
  #2.1
  #H0:E(X)=E(Y)
  #H1:E(X)<E(Y)
  t.test(Y,X, alternative='greater',paired = TRUE, var.equal = FALSE)
  #H0:E(X)=E(Y)
  #H1:E(X)!=E(Y)
  t.test(Y,X, alternative='two.sided', paired = TRUE, var.equal = FALSE)
  #H0:E(X)=E(Y)
  #H1:E(X)>E(Y)
  t.test(Y,X, alternative='less', paired = TRUE)
  #2.2
  #H0:Var(X)=Var(Y)
  #H1:Var(X)≠Var(Y)
  var.test(Y,X, alternative='two.sided')
  #H0:Var(X)=Var(Y)
  #H1:Var(X)>Var(Y)
  var.test(Y,X, alternative='less')
  #H0:Var(X)=Var(Y)
  #H1:Var(X)<Var(Y)
  var.test(Y,X, alternative='greater')

  #Часть 3
  data3 = c()
  data3 = str_replace_all(data3, '[;]', ',')
  data3 = str_replace_all(data3, 'NA', '')
  data3 = str_replace_all(data3, ', ,', ',')
  data3 = str_replace_all(data3, ', ,', ',')
  data3 = c()
  length(data3)
  table(data3)
  summary(data3)
  sort(data3)
  #input sample size and sample proportion
  n <- 154
  p <- 0.3441558
  #calculate margin of error
  margin <- qnorm(0.95)*sqrt(p*(1-p)/n)
  #calculate lower and upper bounds of confidence interval
  low <- p - margin
  low
  high <- p + margin
  high
  library(dplyr)
  table(t)
  barplot(table(data3))
  #3.2
  chisq.test(table(data3), simulate.p.value = TRUE)
  qchisq(0.02,table(data3))
  "
     )
}
